// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "This application can’t run.";
"NoDiskArb Informative" = "There was a problem with starting Disk Arbitration. This shouldn’t happen.";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "Can’t retrieve the list of images.";
"CantGetConfig Informative" = "There was a problem while retrieving the list of available recovery images (%1$@). Please check to make sure that your network connection is working.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "a connection could not be allocated";
"CantGetConfig Error DownloadError" = "an error occurred during download";
"CantGetConfig Error StringCreate" = "the response couldn’t be used";

/* Version error. */
"VersionError Message" = "This version of the application is too old.";
"VersionError Informative" = "Please download a newer version. This is version %1$@; at least version %2$@ is required. %3$@";
"VersionError OK" = "Get New Version";

/* File dialog to select a local file. */
"SelectLocal File" = "Please select an image:";
"SelectLocal Button" = "Select";

/* Alert on writing stick. */
"WriteAlert Message" = "Are you sure that you want to permanently erase the %1$@?";
"WriteAlert Informative" = "All data that’s currently on it will be lost permanently. You can’t undo this action.";
"WriteAlert Cancel" = "Don’t Erase";
"WriteAlert OK" = "Erase";

"TooSmallAlert Message" = "The %1$@ can’t be used; it is too small.";
"TooSmallAlert Informative" = "A stick of at least %2$@ is required.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "The %1$@ can’t be used; it is read-only.";
"NotWritable Informative" = "The stick is read-only. There may be a switch on the stick to allow it to be written to; otherwise it can’t be used.";
"NotWritable OK" = "OK";

/* Stick writing statuses. */
"Status Downloading" = "Downloading…";
"Status Verifying" = "Verifying…";
"Status Unpacking" = "Unpacking…";
"Status Claiming" = "Claiming…";
"Status Unmounting" = "Unmounting…";
"Status Writing" = "Writing…";
"Status Ejecting" = "Ejecting…";
"Status Done" = "Done!";

"StatusAdd Attempt" = " (attempt %1$d)";

/* Errors */
"Failure Downloading" = "Sorry, an error occurred (failed to download the source image). Would you like to try again?";
"Failure Verifying Return Value" = "Sorry, an error occurred (failed to verify the source image, programme failure, %1$s). Would you like to try again?";
"Failure Verifying SHA Mismatch" = "Sorry, an error occurred (failed to verify the source image, checksum failure). Would you like to try again?";
"Failure Unpacking" = "Sorry, an error occurred (failed to unpack the source image, %1$s). Would you like to try again?";
"Failure Claiming" = "Sorry, an error occurred (failed to claim the USB stick). Would you like to try again?";
"Failure Unmounting" = "Sorry, an error occurred (failed to unmount the USB stick). Would you like to try again?";
"Failure Opening Source Image" = "Sorry, an error occurred (failed to open the source image, %1$s). Would you like to try again?";
"Failure Opening Destination Device" = "Sorry, an error occurred (failed to open the USB stick, %1$s). Would you like to try again?";
"Failure Reading Source Image" = "Sorry, an error occurred (failed to read from the source image, %1$s). Would you like to try again?";
"Failure Writing Destination Device" = "Sorry, an error occurred (failed to write data to the USB stick, %1$s). Would you like to try again?";
"Failure Ejecting" = "Sorry, an error occurred (failed to eject the USB stick). Would you like to try again?";

"Failure Try Again" = "Try Again";
"Failure Quit" = "Quit";

"Failure Termination Status" = "Termination Status %d";

"Failure Internal Error 1" = "Unexpected EOF";
